<a href="https://colab.research.google.com/github/renatauribes/hello-world/blob/main/ActividadFormativa_Equipo02.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#### ACTIVIDAD FORMATIVA 1 - CÓMPUTO EN LA NUBE

### María del Carmen Vargas A00828570  

### Renata Uribe Sanchez A01274629

### Frida Sofía Bautista A01235009

### Diego Paasche Portillo A01028103

In [ ]:
print("Hola bienvenidos")

Hola bienvenidos

In [ ]:
from google.colab import drive

In [ ]:
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import random as rd

In [ ]:
df = pd.read_csv("/content/drive/Shareddrives/EQUIPO RETO CIENCIA DE DATOS/titanic (1).csv")
df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

**Variables categóricas**: Name, Sex, Cabin, Ticket, Embarked, Pclass, Survived, PassengerId.

**Variables numéricas:**Age, SibSp, Parch, Fare.

**Describe() muestra las medidas de tendencia básica de nuestra base de datos.**

In [ ]:
df.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

**columns() lee los títulos de cada columna.**

In [ ]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

**info() imprime los primeros y últimos 5 datos de la base de datos. 
Imprime información del data frame, donde incluye el tipo de índice y de columna, memoria utilizada y los valores non-null**

In [ ]:
df.info

<bound method DataFrame.info of      PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]>

**De las variables categóricas indica cuantos valores diferentes se tiene por categoría**

In [ ]:
df[['Sex', 'Name', 'Cabin', 'Ticket', 'Embarked', 'Pclass', 'Survived', 'PassengerId']].nunique() # nunique() cuenta cuántos valores distintos hay

Sex              2
Name           891
Cabin          147
Ticket         681
Embarked         3
Pclass           3
Survived         2
PassengerId    891
dtype: int64

**Extra: contar la cantidad por cada valor único**

In [ ]:
sex = df.Sex
sex.value_counts() # value_counts() cuenta la cantidad que hay por valor único

male      577
female    314
Name: Sex, dtype: int64

In [ ]:
name = df.Name
name.value_counts()

Phillips, Miss. Kate Florence ("Mrs Kate Louise Phillips Marshall")    1
Garside, Miss. Ethel                                                   1
Willey, Mr. Edward                                                     1
Rosblom, Mrs. Viktor (Helena Wilhelmina)                               1
Smith, Miss. Marion Elsie                                              1
                                                                      ..
Frolicher-Stehli, Mr. Maxmillian                                       1
Allen, Mr. William Henry                                               1
Otter, Mr. Richard                                                     1
Stanley, Mr. Edward Roland                                             1
Panula, Mrs. Juha (Maria Emilia Ojala)                                 1
Name: Name, Length: 891, dtype: int64

In [ ]:
cabin = df.Cabin
cabin.value_counts()

C23 C25 C27    4
G6             4
B96 B98        4
D              3
C22 C26        3
              ..
D10 D12        1
E58            1
B69            1
D56            1
F G63          1
Name: Cabin, Length: 147, dtype: int64

In [ ]:
ticket = df.Ticket
ticket.value_counts()

CA. 2343             7
1601                 7
347082               7
347088               6
3101295              6
                    ..
STON/O 2. 3101286    1
A/4. 34244           1
347063               1
17465                1
STON/O2. 3101283     1
Name: Ticket, Length: 681, dtype: int64

In [ ]:
embarked = df.Embarked
embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [ ]:
pclass = df.Pclass
pclass.value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [ ]:
survived = df.Survived
survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [ ]:
passengerId = df.PassengerId
passengerId.value_counts()

891    1
293    1
304    1
303    1
302    1
      ..
591    1
590    1
589    1
588    1
1      1
Name: PassengerId, Length: 891, dtype: int64

**De las variables numéricas indica su valor promedio, mediana, mínimo y máximo.** Age, SibSp, Parch, Fare.

**Manera corta (a continuación)**

In [ ]:
df[['Age', 'SibSp', 'Parch', 'Fare']].describe()

              Age       SibSp       Parch        Fare
count  714.000000  891.000000  891.000000  891.000000
mean    29.699118    0.523008    0.381594   32.204208
std     14.526497    1.102743    0.806057   49.693429
min      0.420000    0.000000    0.000000    0.000000
25%     20.125000    0.000000    0.000000    7.910400
50%     28.000000    0.000000    0.000000   14.454200
75%     38.000000    1.000000    0.000000   31.000000
max     80.000000    8.000000    6.000000  512.329200

**Manera larga (a continuación)**

In [ ]:
age = df.Age
age.describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [ ]:
sibSp = df.SibSp
sibSp.describe()

count    891.000000
mean       0.523008
std        1.102743
min        0.000000
25%        0.000000
50%        0.000000
75%        1.000000
max        8.000000
Name: SibSp, dtype: float64

In [ ]:
parch = df.Parch
parch.describe()

count    891.000000
mean       0.381594
std        0.806057
min        0.000000
25%        0.000000
50%        0.000000
75%        0.000000
max        6.000000
Name: Parch, dtype: float64

In [ ]:
fare = df.Fare
fare.describe()

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: Fare, dtype: float64

**Indica cuánto es el total que se pagó sumando la tarifa de todos los pasajeros.**

In [ ]:
fare = df.Fare
fare.sum()

28693.9493

**Crear un subconjunto de los datos de los que sobrevivieron y otro de los que no sobrevivieron**

In [ ]:
s = df[df.Survived==1] #Sobrevivieron
ns = df[df.Survived==0] #No Sobrevivieron

**Mostrar los datos de 5 personas de las que sobrevivieron y de las que no sobrevivieron.**

In [ ]:
s.sample(5)

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
74            75         1       3  ...  56.4958   NaN         S
300          301         1       3  ...   7.7500   NaN         Q
874          875         1       2  ...  24.0000   NaN         C
447          448         1       1  ...  26.5500   NaN         S
133          134         1       2  ...  26.0000   NaN         S

[5 rows x 12 columns]

In [ ]:
ns.sample(5)

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
836          837         0       3  ...   8.6625   NaN         S
420          421         0       3  ...   7.8958   NaN         C
199          200         0       2  ...  13.0000   NaN         S
26            27         0       3  ...   7.2250   NaN         C
772          773         0       2  ...  10.5000   E77         S

[5 rows x 12 columns]